Repository: kanomahoro1224/danmuku-kano
Catalog: danmuku-kano/Strings/*/Resources.resw
Source language: en_us
Languages: de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pt_br, ru_ru, tr_tr, zh_hans, zh_hant

# TextPerformanceModeDesc
source: Limiting the danmaku frame rate reduces the impact on game FPS; rendering pauses automatically when no danmaku is on screen.
de_de: Die Begrenzung der Danmaku-Bildrate verringert die Auswirkungen auf die Spiel-FPS; ohne Danmaku wird das Rendern automatisch pausiert.
es_es: Limitar la tasa de fotogramas del danmaku reduce el impacto en los FPS del juego; el renderizado se pausa automáticamente cuando no hay danmaku en pantalla.
fr_fr: Limiter la fréquence d'images des danmakus réduit l'impact sur les FPS du jeu ; le rendu se met en pause automatiquement sans danmaku à l'écran.
it_it: Limitare la frequenza dei fotogrammi dei danmaku riduce l'impatto sugli FPS del gioco; il rendering si sospende automaticamente quando non ci sono danmaku.
ja_jp: 弾幕のフレームレートを制限するとゲームへの影響を軽減できます。弾幕がない間は描画を自動的に停止します。
ko_kr: 탄막 프레임 속도를 제한하면 게임 FPS에 미치는 영향을 줄일 수 있습니다. 탄막이 없으면 렌더링이 자동으로 일시 중지됩니다.
pt_br: Limitar a taxa de quadros do danmaku reduz o impacto nos FPS do jogo; a renderização pausa automaticamente quando não há danmaku na tela.
ru_ru: Ограничение частоты кадров данмаку снижает влияние на FPS игры; при отсутствии данмаку отрисовка автоматически приостанавливается.
tr_tr: Danmaku kare hızını sınırlamak oyun FPS'ine etkisini azaltır; ekranda danmaku yokken çizim otomatik olarak duraklatılır.
zh_hant: 限制彈幕更新頻率可降低對遊戲幀率的影響；無彈幕時會自動暫停繪製。

# TextPerfFluent
source: Fluent (match display refresh rate)
de_de: Flüssig (Bildwiederholrate des Bildschirms)
es_es: Fluido (frecuencia de actualización de la pantalla)
fr_fr: Fluide (fréquence de rafraîchissement de l'écran)
it_it: Fluido (frequenza di aggiornamento dello schermo)
ja_jp: スムーズ（画面のリフレッシュレートに同期）
ko_kr: 부드러움(화면 주사율 동기화)
pt_br: Fluido (taxa de atualização da tela)
ru_ru: Плавный (частота обновления экрана)
tr_tr: Akıcı (ekran yenileme hızıyla eşit)
zh_hant: 流暢（跟隨螢幕更新頻率）

# TextPerfBalanced
source: Balanced (up to 60 FPS)
de_de: Ausgewogen (max. 60 FPS)
es_es: Equilibrado (hasta 60 FPS)
fr_fr: Équilibré (60 FPS max)
it_it: Bilanciato (fino a 60 FPS)
ja_jp: バランス（最大 60 FPS）
ko_kr: 균형(최대 60 FPS)
pt_br: Equilibrado (até 60 FPS)
ru_ru: Сбалансированный (до 60 кадров/с)
tr_tr: Dengeli (en fazla 60 FPS)
zh_hant: 均衡（最高 60 幀）

# TextPerfGame
source: Gaming (up to 30 FPS, prioritize game FPS)
de_de: Spiele (max. 30 FPS, Spiel hat Vorrang)
es_es: Juego (hasta 30 FPS, prioriza el juego)
fr_fr: Jeu (30 FPS max, priorité au jeu)
it_it: Gioco (fino a 30 FPS, priorità al gioco)
ja_jp: ゲーム（最大 30 FPS、ゲームを優先）
ko_kr: 게임(최대 30 FPS, 게임 우선)
pt_br: Jogos (até 30 FPS, prioriza o jogo)
ru_ru: Игровой (до 30 кадров/с, приоритет игре)
tr_tr: Oyun (en fazla 30 FPS, oyun öncelikli)
zh_hant: 遊戲（最高 30 幀，優先保證遊戲幀率）

# TextPerfEco
source: Power Saver (up to 15 FPS)
de_de: Energiesparen (max. 15 FPS)
es_es: Ahorro de energía (hasta 15 FPS)
fr_fr: Économie d'énergie (15 FPS max)
it_it: Risparmio energetico (fino a 15 FPS)
ja_jp: 省電力（最大 15 FPS）
ko_kr: 절전(최대 15 FPS)
pt_br: Economia de energia (até 15 FPS)
ru_ru: Энергосбережение (до 15 кадров/с)
tr_tr: Güç tasarrufu (en fazla 15 FPS)
zh_hant: 省電（最高 15 幀）

# TextMaxNotificationLength
source: Maximum notification length
de_de: Maximale Benachrichtigungslänge
ja_jp: 通知の最大文字数
ko_kr: 알림 최대 글자 수
zh_hant: 通知最大字數
